In [2]:
%pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\kerenb\appdata\local\programs\python\python314\lib\site-packages (9.5.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import mysql.connector

In [4]:
import pandas as pd

In [ ]:

db = mysql.connector.connect(
        host="localhost",
        user="root",
        password="",
        database="hrdb",
        use_pure=True
    )

mycursor = db.cursor()
print("Connection successful")

Connection successful

In [6]:
# Write your SQL query
query = "SELECT * FROM table2"  # Replace 'your_table_name' with your actual table name
    
mycursor.execute(query)  # Execute query 
result = mycursor.fetchall()

# Get column names from the cursor
column_names = [i[0] for i in mycursor.description]

# Create a DataFrame from the result
hrtable2 = pd.DataFrame(result, columns=column_names)



    
# Print the DataFrame
#df

In [7]:
hrtable2

,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,1,2,Female,94,3,2,Sales Executive,4,Single,5993,...,1,80,0,8,0,1,6,4,0,5
1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,...,4,80,1,10,3,3,10,7,1,7
2,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,...,2,80,0,7,3,3,0,0,0,0
3,5,4,Female,56,3,1,Research Scientist,3,Married,2909,...,3,80,0,8,3,3,8,7,3,0
4,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,2061,3,Male,41,4,2,Laboratory Technician,4,Married,2571,...,3,80,1,17,3,3,5,2,0,3
1466,2062,4,Male,42,2,3,Healthcare Representative,1,Married,9991,...,1,80,1,9,5,3,7,7,1,7
1467,2064,2,Male,87,4,2,Manufacturing Director,2,Married,6142,...,2,80,1,6,0,3,6,2,0,3
1468,2065,4,Male,63,2,2,Sales Executive,2,Married,5390,...,4,80,0,17,3,2,9,6,0,8
1469,2068,2,Male,82,4,2,Laboratory Technician,3,Married,4404,...,1,80,0,6,3,4,4,3,1,2

In [8]:
def sql_script(query):
    mycursor.execute(query)
    result = mycursor.fetchall()
    column_names = [i[0] for i in mycursor.description]
    df = pd.DataFrame(result, columns=column_names)

    return df

In [9]:
def sql_script(query):
    mycursor.execute(query)
    result = mycursor.fetchall()
    column_names = [i[0] for i in mycursor.description]
    df = pd.DataFrame(result, columns=column_names)

    return df

In [10]:
sql_script("Select * from table1")

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7
...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068

In [11]:
joined_table=sql_script("""SELECT *
FROM table2
INNER JOIN table1
ON table1.EmployeeNumber = table2.EmployeeNumber;""")

In [12]:
joined_table

,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,...,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber
0,1,2,Female,94,3,2,Sales Executive,4,Single,5993,...,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1
1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,...,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2
2,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,...,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4
3,5,4,Female,56,3,1,Research Scientist,3,Married,2909,...,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5
4,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,...,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,2061,3,Male,41,4,2,Laboratory Technician,4,Married,2571,...,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061
1466,2062,4,Male,42,2,3,Healthcare Representative,1,Married,9991,...,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062
1467,2064,2,Male,87,4,2,Manufacturing Director,2,Married,6142,...,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064
1468,2065,4,Male,63,2,2,Sales Executive,2,Married,5390,...,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065
1469,2068,2,Male,82,4,2,Laboratory Technician,3,Married,4404,...,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068

In [13]:
mycursor.description

[('EmployeeNumber', 3, None, None, None, None, 1, 0, 63),
 ('EnvironmentSatisfaction', 3, None, None, None, None, 1, 0, 63),
 ('Gender', 252, None, None, None, None, 1, 16, 255),
 ('HourlyRate', 3, None, None, None, None, 1, 0, 63),
 ('JobInvolvement', 3, None, None, None, None, 1, 0, 63),
 ('JobLevel', 3, None, None, None, None, 1, 0, 63),
 ('JobRole', 252, None, None, None, None, 1, 16, 255),
 ('JobSatisfaction', 3, None, None, None, None, 1, 0, 63),
 ('MaritalStatus', 252, None, None, None, None, 1, 16, 255),
 ('MonthlyIncome', 3, None, None, None, None, 1, 0, 63),
 ('MonthlyRate', 3, None, None, None, None, 1, 0, 63),
 ('NumCompaniesWorked', 3, None, None, None, None, 1, 0, 63),
 ('Over18', 252, None, None, None, None, 1, 16, 255),
 ('OverTime', 252, None, None, None, None, 1, 16, 255),
 ('PercentSalaryHike', 3, None, None, None, None, 1, 0, 63),
 ('PerformanceRating', 3, None, None, None, None, 1, 0, 63),
 ('RelationshipSatisfaction', 3, None, None, None, None, 1, 0, 63),
 ('StandardHours', 3, None, None, None, None, 1, 0, 63),
 ('StockOptionLevel', 3, None, None, None, None, 1, 0, 63),
 ('TotalWorkingYears', 3, None, None, None, None, 1, 0, 63),
 ('TrainingTimesLastYear', 3, None, None, None, None, 1, 0, 63),
 ('WorkLifeBalance', 3, None, None, None, None, 1, 0, 63),
 ('YearsAtCompany', 3, None, None, None, None, 1, 0, 63),
 ('YearsInCurrentRole', 3, None, None, None, None, 1, 0, 63),
 ('YearsSinceLastPromotion', 3, None, None, None, None, 1, 0, 63),
 ('YearsWithCurrManager', 3, None, None, None, None, 1, 0, 63),
 ('Age', 3, None, None, None, None, 1, 0, 63),
 ('Attrition', 252, None, None, None, None, 1, 16, 255),
 ('BusinessTravel', 252, None, None, None, None, 1, 16, 255),
 ('DailyRate', 3, None, None, None, None, 1, 0, 63),
 ('Department', 252, None, None, None, None, 1, 16, 255),
 ('DistanceFromHome', 3, None, None, None, None, 1, 0, 63),
 ('Education', 3, None, None, None, None, 1, 0, 63),
 ('EducationField', 252, None, None, None, None, 1, 16, 255),
 ('EmployeeCount', 3, None, None, None, None, 1, 0, 63),
 ('EmployeeNumber', 3, None, None, None, None, 1, 0, 63)]

EDA 
# Identify missing values and handle them appropriately.
# Perform summary statistics and visualize data distributions.
# Identify potential correlations between features that may contribute to
attrition.

In [14]:
joined_table.shape

(1470, 36)

In [ ]:
joined_table.head()

,EmployeeNumber,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,...,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber
0,1,2,Female,94,3,2,Sales Executive,4,Single,5993,...,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1
1,2,3,Male,61,2,2,Research Scientist,2,Married,5130,...,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2
2,4,4,Male,92,2,1,Laboratory Technician,3,Single,2090,...,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4
3,5,4,Female,56,3,1,Research Scientist,3,Married,2909,...,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5
4,7,1,Male,40,3,1,Laboratory Technician,2,Married,3468,...,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7

In [16]:
joined_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 36 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   EmployeeNumber            1470 non-null   int64
 1   EnvironmentSatisfaction   1470 non-null   int64
 2   Gender                    1470 non-null   object
 3   HourlyRate                1470 non-null   int64
 4   JobInvolvement            1470 non-null   int64
 5   JobLevel                  1470 non-null   int64
 6   JobRole                   1470 non-null   object
 7   JobSatisfaction           1470 non-null   int64
 8   MaritalStatus             1470 non-null   object
 9   MonthlyIncome             1470 non-null   int64
 10  MonthlyRate               1470 non-null   int64
 11  NumCompaniesWorked        1470 non-null   int64
 12  Over18                    1470 non-null   object
 13  OverTime                  1470 non-null   object
 14  PercentSalaryHike         1470 non-null   int64
 15  PerformanceRating         1470 non-null   int64
 16  RelationshipSatisfaction  1470 non-null   int64
 17  StandardHours             1470 non-null   int64
 18  StockOptionLevel          1470 non-null   int64
 19  TotalWorkingYears         1470 non-null   int64
 20  TrainingTimesLastYear     1470 non-null   int64
 21  WorkLifeBalance           1470 non-null   int64
 22  YearsAtCompany            1470 non-null   int64
 23  YearsInCurrentRole        1470 non-null   int64
 24  YearsSinceLastPromotion   1470 non-null   int64
 25  YearsWithCurrManager      1470 non-null   int64
 26  Age                       1470 non-null   int64
 27  Attrition                 1470 non-null   object
 28  BusinessTravel            1470 non-null   object
 29  DailyRate                 1470 non-null   int64
 30  Department                1470 non-null   object
 31  DistanceFromHome          1470 non-null   int64
 32  Education                 1470 non-null   int64
 33  EducationField            1470 non-null   object
 34  EmployeeCount             1470 non-null   int64
 35  EmployeeNumber            1470 non-null   int64
dtypes: int64(27), object(9)
memory usage: 413.6+ KB

In [20]:
joined_table.nunique(axis=0)

EmployeeNumber              1470
EnvironmentSatisfaction        4
Gender                         2
HourlyRate                    71
JobInvolvement                 4
JobLevel                       5
JobRole                        9
JobSatisfaction                4
MaritalStatus                  3
MonthlyIncome               1349
MonthlyRate                 1427
NumCompaniesWorked            10
Over18                         1
OverTime                       2
PercentSalaryHike             15
PerformanceRating              2
RelationshipSatisfaction       4
StandardHours                  1
StockOptionLevel               4
TotalWorkingYears             40
TrainingTimesLastYear          7
WorkLifeBalance                4
YearsAtCompany                37
YearsInCurrentRole            19
YearsSinceLastPromotion       16
YearsWithCurrManager          18
Age                           43
Attrition                      2
BusinessTravel                 3
DailyRate                    886
Department                     3
DistanceFromHome              29
Education                      5
EducationField                 6
EmployeeCount                  1
EmployeeNumber              1470
dtype: int64

In [23]:
joined_table.describe()

,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,JobSatisfaction,MonthlyIncome,MonthlyRate,NumCompaniesWorked,PercentSalaryHike,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber
count,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,...,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.0,1470.000000
mean,1024.865306,2.721769,65.891156,2.729932,2.063946,2.728571,6502.931293,14313.103401,2.693197,15.209524,...,7.008163,4.229252,2.187755,4.123129,36.923810,802.485714,9.192517,2.912925,1.0,1024.865306
std,602.024335,1.093082,20.329428,0.711561,1.106940,1.102846,4707.956783,7117.786044,2.498009,3.659938,...,6.126525,3.623137,3.222430,3.568136,9.135373,403.509100,8.106864,1.024165,0.0,602.024335
min,1.000000,1.000000,30.000000,1.000000,1.000000,1.000000,1009.000000,2094.000000,0.000000,11.000000,...,0.000000,0.000000,0.000000,0.000000,18.000000,102.000000,1.000000,1.000000,1.0,1.000000
25%,491.250000,2.000000,48.000000,2.000000,1.000000,2.000000,2911.000000,8047.000000,1.000000,12.000000,...,3.000000,2.000000,0.000000,2.000000,30.000000,465.000000,2.000000,2.000000,1.0,491.250000
50%,1020.500000,3.000000,66.000000,3.000000,2.000000,3.000000,4919.000000,14235.500000,2.000000,14.000000,...,5.000000,3.000000,1.000000,3.000000,36.000000,802.000000,7.000000,3.000000,1.0,1020.500000
75%,1555.750000,4.000000,83.750000,3.000000,3.000000,4.000000,8379.000000,20461.500000,4.000000,18.000000,...,9.000000,7.000000,3.000000,7.000000,43.000000,1157.000000,14.000000,4.000000,1.0,1555.750000
max,2068.000000,4.000000,100.000000,4.000000,5.000000,4.000000,19999.000000,26999.000000,9.000000,25.000000,...,40.000000,18.000000,15.000000,17.000000,60.000000,1499.000000,29.000000,5.000000,1.0,2068.000000

4.3 Work-Life Balance and Satisfaction